sfproductlabs/ADuCM350/ADuCM350-1.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>ADI_ANA</name>
			<description>Analog Control</description>
			<groupName>ANA</groupName>
			<baseAddress>0x40008810</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x78</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>REFCTRL</name>
					<addressOffset>0x00000030</addressOffset>
					<size>0x00000010</size>
					<description>Internal Reference Control register</description>
					<fields>
						<field>
							<name>REFPD</name>
							<description>Power down reference</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>IEXCCON</name>
					<addressOffset>0x00000040</addressOffset>
					<size>0x00000008</size>
					<description>Controls the on-chip Excitation Current Sources</description>
					<fields>
						<field>
							<name>PD</name>
							<description>IEXC Power down- bits</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>En</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>off</name>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>REFSEL</name>
							<description>IREF Source- bits</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>Ext</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Int</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IPSEL1</name>
							<description>Select IEXC1 pin AIN- bits</description>
							<bitOffset>3</bitOffset>
							<bitWidth>3</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>Off</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN4</name>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN5</name>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN6</name>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN7</name>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IPSEL0</name>
							<description>Select IEXC0 pin AIN- bits</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>Off</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN4</name>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN5</name>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN6</name>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN7</name>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>IEXCDAT</name>
					<addressOffset>0x00000044</addressOffset>
					<size>0x00000008</size>
					<description>Sets the output current setting for both Excitation Current sources</description>
					<fields>
						<field>
							<name>IDAT</name>
							<description>Output Current- bits</description>
							<bitOffset>1</bitOffset>
							<bitWidth>5</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>0uA</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>50uA</name>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>100uA</name>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>150uA</name>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>200uA</name>
									<value>7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>250uA</name>
									<value>20</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>300uA</name>
									<value>10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>400uA</name>
									<value>11</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>450uA</name>
									<value>14</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>500uA</name>
									<value>21</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>600uA</name>
									<value>15</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>750uA</name>
									<value>22</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>800uA</name>
									<value>19</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1mA</name>
									<value>31</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IDAT0</name>
							<description>10uA Enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
