sfproductlabs/ADuCM350/ADuCM350-1.svd
				<register>
					<name>ADC1MDE</name>
					<addressOffset>0x00000024</addressOffset>
					<size>0x00000010</size>
					<description>mode control register</description>
					<fields>
						<field>
							<name>PGA</name>
							<description>PGA Gain Select bit</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>G1</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>G2</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>G4</name>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>G8</name>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>G16</name>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>G32</name>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>G64</name>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>G128</name>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADCMOD2</name>
							<description>ADC modulator gain of 2 control bits</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>MOD2OFF</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MOD2ON</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADCMD</name>
							<description>ADC Mode bits</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>OFF</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CONT</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SINGLE</name>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>IDLE</name>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INTOCAL</name>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INTGCAL</name>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SYSOCAL</name>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SYSGCAL</name>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>ADC1RCR</name>
					<addressOffset>0x00000028</addressOffset>
					<size>0x00000010</size>
					<description>Number of ADC1 conversions before an ADC interrupt is generated.</description>
					<fields>
						<field>
							<name>VALUE</name>
							<description>TBD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>ADC1RCV</name>
					<addressOffset>0x0000002C</addressOffset>
					<size>0x00000010</size>
					<description>"This 16-bit, read-only MMR holds the current number of ADC1 conversion results"</description>
					<fields>
						<field>
							<name>VALUE</name>
							<description>TBD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>ADC1TH</name>
					<addressOffset>0x00000030</addressOffset>
					<size>0x00000010</size>
					<description>Sets the threshold</description>
					<fields>
						<field>
							<name>VALUE</name>
							<description>TBD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>ADC1THC</name>
					<addressOffset>0x00000034</addressOffset>
					<size>0x00000008</size>
					<description>Determines how many cumulative ADC1 conversion result readings above ADC1TH must occur</description>
					<fields>
						<field>
							<name>VALUE</name>
							<description>TBD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>ADC1THV</name>
					<addressOffset>0x00000038</addressOffset>
					<size>0x00000008</size>
					<description>8-bit threshold exceeded counter register</description>
					<fields>
						<field>
							<name>VALUE</name>
							<description>TBD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>ADC1ACC</name>
					<addressOffset>0x0000003C</addressOffset>
					<size>0x00000020</size>
					<description>32-bit accumulator register</description>
					<fields>
						<field>
							<name>VALUE</name>
							<description>TBD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>ADC1ATH</name>
					<addressOffset>0x00000040</addressOffset>
					<size>0x00000020</size>
					<description>Holds the threshold value for the accumulator comparator</description>
					<fields>
						<field>
							<name>VALUE</name>
							<description>TBD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>ADC1PRO</name>
					<addressOffset>0x00000044</addressOffset>
					<size>0x00000008</size>
					<description>Configuration register for Post processing of ADC1 results</description>
					<fields>
						<field>
							<name>ACCEN</name>
							<description>ADC Accumulator Enable bits</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>Off</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>En</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EnNDec</name>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EnAccCnt</name>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMPEN</name>
							<description>ADC Comparator Enable bits</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>Off</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>En</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EnCnt</name>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EnCntDec</name>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OREN</name>
							<description>ADC OverRange Enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RCEN</name>
							<description>ADC Result Counter Enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>ADC1DAT</name>
					<addressOffset>0x00000048</addressOffset>
					<size>0x00000020</size>
					<description>conversion result register</description>
					<fields>
						<field>
							<name>VALUE</name>
							<description>TBD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
